turbq/atprog/packs/atmel/SAM3X_DFP/1.0.50/atdf/ATSAM3X8E.atdf
      <value-group caption="" name="CAN_MMR3__MOT">
        <value caption="Mailbox is disabled. This prevents receiving or transmitting any messages with this mailbox." name="MB_DISABLED" value="0x0"/>
        <value caption="Reception Mailbox. Mailbox is configured for reception. If a message is received while the mailbox data register is full, it is discarded." name="MB_RX" value="0x1"/>
        <value caption="Reception mailbox with overwrite. Mailbox is configured for reception. If a message is received while the mailbox is full, it overwrites the previous message." name="MB_RX_OVERWRITE" value="0x2"/>
        <value caption="Transmit mailbox. Mailbox is configured for transmission." name="MB_TX" value="0x3"/>
        <value caption="Consumer Mailbox. Mailbox is configured in reception but behaves as a Transmit Mailbox, i.e., it sends a remote frame and waits for an answer." name="MB_CONSUMER" value="0x4"/>
        <value caption="Producer Mailbox. Mailbox is configured in transmission but also behaves like a reception mailbox, i.e., it waits to receive a Remote Frame before sending its contents." name="MB_PRODUCER" value="0x5"/>
      </value-group>
      <value-group caption="" name="CAN_MMR4__MOT">
        <value caption="Mailbox is disabled. This prevents receiving or transmitting any messages with this mailbox." name="MB_DISABLED" value="0x0"/>
        <value caption="Reception Mailbox. Mailbox is configured for reception. If a message is received while the mailbox data register is full, it is discarded." name="MB_RX" value="0x1"/>
        <value caption="Reception mailbox with overwrite. Mailbox is configured for reception. If a message is received while the mailbox is full, it overwrites the previous message." name="MB_RX_OVERWRITE" value="0x2"/>
        <value caption="Transmit mailbox. Mailbox is configured for transmission." name="MB_TX" value="0x3"/>
        <value caption="Consumer Mailbox. Mailbox is configured in reception but behaves as a Transmit Mailbox, i.e., it sends a remote frame and waits for an answer." name="MB_CONSUMER" value="0x4"/>
        <value caption="Producer Mailbox. Mailbox is configured in transmission but also behaves like a reception mailbox, i.e., it waits to receive a Remote Frame before sending its contents." name="MB_PRODUCER" value="0x5"/>
      </value-group>
      <value-group caption="" name="CAN_MMR5__MOT">
        <value caption="Mailbox is disabled. This prevents receiving or transmitting any messages with this mailbox." name="MB_DISABLED" value="0x0"/>
        <value caption="Reception Mailbox. Mailbox is configured for reception. If a message is received while the mailbox data register is full, it is discarded." name="MB_RX" value="0x1"/>
        <value caption="Reception mailbox with overwrite. Mailbox is configured for reception. If a message is received while the mailbox is full, it overwrites the previous message." name="MB_RX_OVERWRITE" value="0x2"/>
        <value caption="Transmit mailbox. Mailbox is configured for transmission." name="MB_TX" value="0x3"/>
        <value caption="Consumer Mailbox. Mailbox is configured in reception but behaves as a Transmit Mailbox, i.e., it sends a remote frame and waits for an answer." name="MB_CONSUMER" value="0x4"/>
        <value caption="Producer Mailbox. Mailbox is configured in transmission but also behaves like a reception mailbox, i.e., it waits to receive a Remote Frame before sending its contents." name="MB_PRODUCER" value="0x5"/>
      </value-group>
      <value-group caption="" name="CAN_MMR6__MOT">
        <value caption="Mailbox is disabled. This prevents receiving or transmitting any messages with this mailbox." name="MB_DISABLED" value="0x0"/>
        <value caption="Reception Mailbox. Mailbox is configured for reception. If a message is received while the mailbox data register is full, it is discarded." name="MB_RX" value="0x1"/>
        <value caption="Reception mailbox with overwrite. Mailbox is configured for reception. If a message is received while the mailbox is full, it overwrites the previous message." name="MB_RX_OVERWRITE" value="0x2"/>
        <value caption="Transmit mailbox. Mailbox is configured for transmission." name="MB_TX" value="0x3"/>
        <value caption="Consumer Mailbox. Mailbox is configured in reception but behaves as a Transmit Mailbox, i.e., it sends a remote frame and waits for an answer." name="MB_CONSUMER" value="0x4"/>
        <value caption="Producer Mailbox. Mailbox is configured in transmission but also behaves like a reception mailbox, i.e., it waits to receive a Remote Frame before sending its contents." name="MB_PRODUCER" value="0x5"/>
      </value-group>
      <value-group caption="" name="CAN_MMR7__MOT">
        <value caption="Mailbox is disabled. This prevents receiving or transmitting any messages with this mailbox." name="MB_DISABLED" value="0x0"/>
        <value caption="Reception Mailbox. Mailbox is configured for reception. If a message is received while the mailbox data register is full, it is discarded." name="MB_RX" value="0x1"/>
        <value caption="Reception mailbox with overwrite. Mailbox is configured for reception. If a message is received while the mailbox is full, it overwrites the previous message." name="MB_RX_OVERWRITE" value="0x2"/>
        <value caption="Transmit mailbox. Mailbox is configured for transmission." name="MB_TX" value="0x3"/>
        <value caption="Consumer Mailbox. Mailbox is configured in reception but behaves as a Transmit Mailbox, i.e., it sends a remote frame and waits for an answer." name="MB_CONSUMER" value="0x4"/>
        <value caption="Producer Mailbox. Mailbox is configured in transmission but also behaves like a reception mailbox, i.e., it waits to receive a Remote Frame before sending its contents." name="MB_PRODUCER" value="0x5"/>
      </value-group>
    </module>
    <module caption="Chip Identifier" name="CHIPID" version="6417R">
      <register-group name="CHIPID">
        <register caption="Chip ID Register" name="CHIPID_CIDR" offset="0x0" rw="R" size="4">
          <bitfield caption="Version of the Device" mask="0x0000001F" name="VERSION"/>
          <bitfield caption="Embedded Processor" mask="0x000000E0" name="EPROC" values="CHIPID_CIDR__EPROC"/>
          <bitfield caption="Nonvolatile Program Memory Size" mask="0x00000F00" name="NVPSIZ" values="CHIPID_CIDR__NVPSIZ"/>
          <bitfield caption="Second Nonvolatile Program Memory Size" mask="0x0000F000" name="NVPSIZ2" values="CHIPID_CIDR__NVPSIZ2"/>
          <bitfield caption="Internal SRAM Size" mask="0x000F0000" name="SRAMSIZ" values="CHIPID_CIDR__SRAMSIZ"/>
          <bitfield caption="Architecture Identifier" mask="0x0FF00000" name="ARCH" values="CHIPID_CIDR__ARCH"/>
          <bitfield caption="Nonvolatile Program Memory Type" mask="0x70000000" name="NVPTYP" values="CHIPID_CIDR__NVPTYP"/>
          <bitfield caption="Extension Flag" mask="0x80000000" name="EXT"/>
        </register>
        <register caption="Chip ID Extension Register" name="CHIPID_EXID" offset="0x4" rw="R" size="4">
          <bitfield caption="Chip ID Extension" mask="0xFFFFFFFF" name="EXID"/>
        </register>
      </register-group>
      <value-group caption="" name="CHIPID_CIDR__EPROC">
        <value caption="ARM946ES" name="ARM946ES" value="0x1"/>
        <value caption="ARM7TDMI" name="ARM7TDMI" value="0x2"/>
        <value caption="Cortex-M3" name="CM3" value="0x3"/>
        <value caption="ARM920T" name="ARM920T" value="0x4"/>
        <value caption="ARM926EJS" name="ARM926EJS" value="0x5"/>
        <value caption="Cortex-A5" name="CA5" value="0x6"/>
        <value caption="Cortex-M4" name="CM4" value="0x7"/>
      </value-group>
