turbq/atprog/packs/atmel/SAM3X_DFP/1.0.50/atdf/ATSAM3X8E.atdf
      <value-group caption="" name="EEFC_FCR__FKEY">
        <value caption="The 0x5A value enables the command defined by the bits of the register. If the field is written with a different value, the write is not performed and no action is started." name="PASSWD" value="0x5A"/>
      </value-group>
    </module>
    <module caption="Ethernet MAC 10/100" name="EMAC" version="6119I">
      <register-group name="EMAC">
        <register caption="Network Control Register" name="EMAC_NCR" offset="0x00" rw="RW" size="4">
          <bitfield caption="LoopBack" mask="0x00000001" name="LB"/>
          <bitfield caption="Loopback local" mask="0x00000002" name="LLB"/>
          <bitfield caption="Receive enable" mask="0x00000004" name="RE"/>
          <bitfield caption="Transmit enable" mask="0x00000008" name="TE"/>
          <bitfield caption="Management port enable" mask="0x00000010" name="MPE"/>
          <bitfield caption="Clear statistics registers" mask="0x00000020" name="CLRSTAT"/>
          <bitfield caption="Increment statistics registers" mask="0x00000040" name="INCSTAT"/>
          <bitfield caption="Write enable for statistics registers" mask="0x00000080" name="WESTAT"/>
          <bitfield caption="Back pressure" mask="0x00000100" name="BP"/>
          <bitfield caption="Start transmission" mask="0x00000200" name="TSTART"/>
          <bitfield caption="Transmit halt" mask="0x00000400" name="THALT"/>
        </register>
        <register caption="Network Configuration Register" name="EMAC_NCFGR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Speed" mask="0x00000001" name="SPD"/>
          <bitfield caption="Full Duplex" mask="0x00000002" name="FD"/>
          <bitfield caption="Jumbo Frames" mask="0x00000008" name="JFRAME"/>
          <bitfield caption="Copy All Frames" mask="0x00000010" name="CAF"/>
          <bitfield caption="No Broadcast" mask="0x00000020" name="NBC"/>
          <bitfield caption="Multicast Hash Enable" mask="0x00000040" name="MTI"/>
          <bitfield caption="Unicast Hash Enable" mask="0x00000080" name="UNI"/>
          <bitfield caption="Receive 1536 bytes frames" mask="0x00000100" name="BIG"/>
          <bitfield caption="MDC clock divider" mask="0x00000C00" name="CLK" values="EMAC_NCFGR__CLK"/>
          <bitfield caption="Retry test" mask="0x00001000" name="RTY"/>
          <bitfield caption="Pause Enable" mask="0x00002000" name="PAE"/>
          <bitfield caption="Receive Buffer Offset" mask="0x0000C000" name="RBOF" values="EMAC_NCFGR__RBOF"/>
          <bitfield caption="Receive Length field Checking Enable" mask="0x00010000" name="RLCE"/>
          <bitfield caption="Discard Receive FCS" mask="0x00020000" name="DRFCS"/>
          <bitfield caption="" mask="0x00040000" name="EFRHD"/>
          <bitfield caption="Ignore RX FCS" mask="0x00080000" name="IRXFCS"/>
        </register>
        <register caption="Network Status Register" name="EMAC_NSR" offset="0x08" rw="R" size="4">
          <bitfield caption="" mask="0x00000002" name="MDIO"/>
          <bitfield caption="" mask="0x00000004" name="IDLE"/>
        </register>
        <register caption="Transmit Status Register" name="EMAC_TSR" offset="0x14" rw="RW" size="4">
          <bitfield caption="Used Bit Read" mask="0x00000001" name="UBR"/>
          <bitfield caption="Collision Occurred" mask="0x00000002" name="COL"/>
          <bitfield caption="Retry Limit exceeded" mask="0x00000004" name="RLES"/>
          <bitfield caption="Transmit Go" mask="0x00000008" name="TGO"/>
          <bitfield caption="Buffers exhausted mid frame" mask="0x00000010" name="BEX"/>
          <bitfield caption="Transmit Complete" mask="0x00000020" name="COMP"/>
          <bitfield caption="Transmit Underrun" mask="0x00000040" name="UND"/>
        </register>
        <register caption="Receive Buffer Queue Pointer Register" name="EMAC_RBQP" offset="0x18" rw="RW" size="4">
          <bitfield caption="Receive buffer queue pointer address" mask="0xFFFFFFFC" name="ADDR"/>
        </register>
        <register caption="Transmit Buffer Queue Pointer Register" name="EMAC_TBQP" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Transmit buffer queue pointer address" mask="0xFFFFFFFC" name="ADDR"/>
        </register>
        <register caption="Receive Status Register" name="EMAC_RSR" offset="0x20" rw="RW" size="4">
          <bitfield caption="Buffer Not Available" mask="0x00000001" name="BNA"/>
          <bitfield caption="Frame Received" mask="0x00000002" name="REC"/>
          <bitfield caption="Receive Overrun" mask="0x00000004" name="OVR"/>
        </register>
        <register caption="Interrupt Status Register" name="EMAC_ISR" offset="0x24" rw="RW" size="4">
          <bitfield caption="Management Frame Done" mask="0x00000001" name="MFD"/>
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="Receive Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Transmit Used Bit Read" mask="0x00000008" name="TXUBR"/>
          <bitfield caption="Ethernet Transmit Buffer Underrun" mask="0x00000010" name="TUND"/>
          <bitfield caption="Retry Limit Exceeded" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Error" mask="0x00000040" name="TXERR"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="Hresp not OK" mask="0x00000800" name="HRESP"/>
          <bitfield caption="Pause Frame Received" mask="0x00001000" name="PFRE"/>
          <bitfield caption="Pause Time Zero" mask="0x00002000" name="PTZ"/>
        </register>
        <register caption="Interrupt Enable Register" name="EMAC_IER" offset="0x28" rw="W" size="4">
          <bitfield caption="Management Frame sent" mask="0x00000001" name="MFD"/>
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="Receive Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Transmit Used Bit Read" mask="0x00000008" name="TXUBR"/>
          <bitfield caption="Ethernet Transmit Buffer Underrun" mask="0x00000010" name="TUND"/>
          <bitfield caption="Retry Limit Exceeded" mask="0x00000020" name="RLE"/>
          <bitfield caption="" mask="0x00000040" name="TXERR"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="Hresp not OK" mask="0x00000800" name="HRESP"/>
          <bitfield caption="Pause Frame Received" mask="0x00001000" name="PFR"/>
          <bitfield caption="Pause Time Zero" mask="0x00002000" name="PTZ"/>
        </register>
        <register caption="Interrupt Disable Register" name="EMAC_IDR" offset="0x2C" rw="W" size="4">
          <bitfield caption="Management Frame sent" mask="0x00000001" name="MFD"/>
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="Receive Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Transmit Used Bit Read" mask="0x00000008" name="TXUBR"/>
          <bitfield caption="Ethernet Transmit Buffer Underrun" mask="0x00000010" name="TUND"/>
          <bitfield caption="Retry Limit Exceeded" mask="0x00000020" name="RLE"/>
          <bitfield caption="" mask="0x00000040" name="TXERR"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="Hresp not OK" mask="0x00000800" name="HRESP"/>
          <bitfield caption="Pause Frame Received" mask="0x00001000" name="PFR"/>
          <bitfield caption="Pause Time Zero" mask="0x00002000" name="PTZ"/>
        </register>
        <register caption="Interrupt Mask Register" name="EMAC_IMR" offset="0x30" rw="R" size="4">
          <bitfield caption="Management Frame sent" mask="0x00000001" name="MFD"/>
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="Receive Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Transmit Used Bit Read" mask="0x00000008" name="TXUBR"/>
          <bitfield caption="Ethernet Transmit Buffer Underrun" mask="0x00000010" name="TUND"/>
          <bitfield caption="Retry Limit Exceeded" mask="0x00000020" name="RLE"/>
          <bitfield caption="" mask="0x00000040" name="TXERR"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="Hresp not OK" mask="0x00000800" name="HRESP"/>
          <bitfield caption="Pause Frame Received" mask="0x00001000" name="PFR"/>
          <bitfield caption="Pause Time Zero" mask="0x00002000" name="PTZ"/>
        </register>
        <register caption="Phy Maintenance Register" name="EMAC_MAN" offset="0x34" rw="RW" size="4">
          <bitfield caption="" mask="0x0000FFFF" name="DATA"/>
          <bitfield caption="" mask="0x00030000" name="CODE"/>
          <bitfield caption="Register Address" mask="0x007C0000" name="REGA"/>
          <bitfield caption="PHY Address" mask="0x0F800000" name="PHYA"/>
          <bitfield caption="Read-write" mask="0x30000000" name="RW"/>
          <bitfield caption="Start of frame" mask="0xC0000000" name="SOF"/>
        </register>
        <register caption="Pause Time Register" name="EMAC_PTR" offset="0x38" rw="RW" size="4">
          <bitfield caption="Pause Time" mask="0x0000FFFF" name="PTIME"/>
        </register>
        <register caption="Pause Frames Received Register" name="EMAC_PFR" offset="0x3C" rw="RW" size="4">
          <bitfield caption="Pause Frames received OK" mask="0x0000FFFF" name="FROK"/>
        </register>
        <register caption="Frames Transmitted Ok Register" name="EMAC_FTO" offset="0x40" rw="RW" size="4">
          <bitfield caption="Frames Transmitted OK" mask="0x00FFFFFF" name="FTOK"/>
        </register>
        <register caption="Single Collision Frames Register" name="EMAC_SCF" offset="0x44" rw="RW" size="4">
          <bitfield caption="Single Collision Frames" mask="0x0000FFFF" name="SCF"/>
        </register>
