turbq/atprog/packs/atmel/SAM3X_DFP/1.0.50/atdf/ATSAM3X8E.atdf
        <register caption="Multiple Collision Frames Register" name="EMAC_MCF" offset="0x48" rw="RW" size="4">
          <bitfield caption="Multicollision Frames" mask="0x0000FFFF" name="MCF"/>
        </register>
        <register caption="Frames Received Ok Register" name="EMAC_FRO" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Frames Received OK" mask="0x00FFFFFF" name="FROK"/>
        </register>
        <register caption="Frame Check Sequence Errors Register" name="EMAC_FCSE" offset="0x50" rw="RW" size="4">
          <bitfield caption="Frame Check Sequence Errors" mask="0x000000FF" name="FCSE"/>
        </register>
        <register caption="Alignment Errors Register" name="EMAC_ALE" offset="0x54" rw="RW" size="4">
          <bitfield caption="Alignment Errors" mask="0x000000FF" name="ALE"/>
        </register>
        <register caption="Deferred Transmission Frames Register" name="EMAC_DTF" offset="0x58" rw="RW" size="4">
          <bitfield caption="Deferred Transmission Frames" mask="0x0000FFFF" name="DTF"/>
        </register>
        <register caption="Late Collisions Register" name="EMAC_LCOL" offset="0x5C" rw="RW" size="4">
          <bitfield caption="Late Collisions" mask="0x000000FF" name="LCOL"/>
        </register>
        <register caption="Excessive Collisions Register" name="EMAC_ECOL" offset="0x60" rw="RW" size="4">
          <bitfield caption="Excessive Collisions" mask="0x000000FF" name="EXCOL"/>
        </register>
        <register caption="Transmit Underrun Errors Register" name="EMAC_TUND" offset="0x64" rw="RW" size="4">
          <bitfield caption="Transmit Underruns" mask="0x000000FF" name="TUND"/>
        </register>
        <register caption="Carrier Sense Errors Register" name="EMAC_CSE" offset="0x68" rw="RW" size="4">
          <bitfield caption="Carrier Sense Errors" mask="0x000000FF" name="CSE"/>
        </register>
        <register caption="Receive Resource Errors Register" name="EMAC_RRE" offset="0x6C" rw="RW" size="4">
          <bitfield caption="Receive Resource Errors" mask="0x0000FFFF" name="RRE"/>
        </register>
        <register caption="Receive Overrun Errors Register" name="EMAC_ROV" offset="0x70" rw="RW" size="4">
          <bitfield caption="Receive Overrun" mask="0x000000FF" name="ROVR"/>
        </register>
        <register caption="Receive Symbol Errors Register" name="EMAC_RSE" offset="0x74" rw="RW" size="4">
          <bitfield caption="Receive Symbol Errors" mask="0x000000FF" name="RSE"/>
        </register>
        <register caption="Excessive Length Errors Register" name="EMAC_ELE" offset="0x78" rw="RW" size="4">
          <bitfield caption="Excessive Length Errors" mask="0x000000FF" name="EXL"/>
        </register>
        <register caption="Receive Jabbers Register" name="EMAC_RJA" offset="0x7C" rw="RW" size="4">
          <bitfield caption="Receive Jabbers" mask="0x000000FF" name="RJB"/>
        </register>
        <register caption="Undersize Frames Register" name="EMAC_USF" offset="0x80" rw="RW" size="4">
          <bitfield caption="Undersize frames" mask="0x000000FF" name="USF"/>
        </register>
        <register caption="SQE Test Errors Register" name="EMAC_STE" offset="0x84" rw="RW" size="4">
          <bitfield caption="SQE test errors" mask="0x000000FF" name="SQER"/>
        </register>
        <register caption="Received Length Field Mismatch Register" name="EMAC_RLE" offset="0x88" rw="RW" size="4">
          <bitfield caption="Receive Length Field Mismatch" mask="0x000000FF" name="RLFM"/>
        </register>
        <register caption="Hash Register Bottom [31:0] Register" name="EMAC_HRB" offset="0x90" rw="RW" size="4">
          <bitfield caption="" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Hash Register Top [63:32] Register" name="EMAC_HRT" offset="0x94" rw="RW" size="4">
          <bitfield caption="" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 1 Bottom Register" name="EMAC_SA1B" offset="0x98" rw="RW" size="4">
          <bitfield caption="" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 1 Top Register" name="EMAC_SA1T" offset="0x9C" rw="RW" size="4">
          <bitfield caption="" mask="0x0000FFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 2 Bottom Register" name="EMAC_SA2B" offset="0xA0" rw="RW" size="4">
          <bitfield caption="" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 2 Top Register" name="EMAC_SA2T" offset="0xA4" rw="RW" size="4">
          <bitfield caption="" mask="0x0000FFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 3 Bottom Register" name="EMAC_SA3B" offset="0xA8" rw="RW" size="4">
          <bitfield caption="" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 3 Top Register" name="EMAC_SA3T" offset="0xAC" rw="RW" size="4">
          <bitfield caption="" mask="0x0000FFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 4 Bottom Register" name="EMAC_SA4B" offset="0xB0" rw="RW" size="4">
          <bitfield caption="" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 4 Top Register" name="EMAC_SA4T" offset="0xB4" rw="RW" size="4">
          <bitfield caption="" mask="0x0000FFFF" name="ADDR"/>
        </register>
        <register caption="Type ID Checking Register" name="EMAC_TID" offset="0xB8" rw="RW" size="4">
          <bitfield caption="Type ID checking" mask="0x0000FFFF" name="TID"/>
        </register>
        <register caption="User Input/Output Register" name="EMAC_USRIO" offset="0xC0" rw="RW" size="4">
          <bitfield caption="Reduce MII" mask="0x00000001" name="RMII"/>
          <bitfield caption="Clock Enable" mask="0x00000002" name="CLKEN"/>
        </register>
      </register-group>
      <value-group caption="" name="EMAC_NCFGR__CLK">
        <value caption="MCK divided by 8 (MCK up to 20 MHz)." name="MCK_8" value="0x0"/>
        <value caption="MCK divided by 16 (MCK up to 40 MHz)." name="MCK_16" value="0x1"/>
        <value caption="MCK divided by 32 (MCK up to 80 MHz)." name="MCK_32" value="0x2"/>
        <value caption="MCK divided by 64 (MCK up to 160 MHz)." name="MCK_64" value="0x3"/>
      </value-group>
      <value-group caption="" name="EMAC_NCFGR__RBOF">
        <value caption="No offset from start of receive buffer." name="OFFSET_0" value="0x0"/>
        <value caption="One-byte offset from start of receive buffer." name="OFFSET_1" value="0x1"/>
        <value caption="Two-byte offset from start of receive buffer." name="OFFSET_2" value="0x2"/>
        <value caption="Three-byte offset from start of receive buffer." name="OFFSET_3" value="0x3"/>
      </value-group>
    </module>
    <module caption="General Purpose Backup Registers" name="GPBR" version="6378D">
      <register-group name="GPBR">
        <register caption="General Purpose Backup Register 0" name="SYS_GPBR0" offset="0x0" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
