turbq/atprog/packs/atmel/SAM3X_DFP/1.0.50/atdf/ATSAM3X8E.atdf
        <register caption="FIFO Memory Aperture0 221" name="HSMCI_FIFO221" offset="0x574" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 222" name="HSMCI_FIFO222" offset="0x578" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 223" name="HSMCI_FIFO223" offset="0x57C" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 224" name="HSMCI_FIFO224" offset="0x580" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 225" name="HSMCI_FIFO225" offset="0x584" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 226" name="HSMCI_FIFO226" offset="0x588" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 227" name="HSMCI_FIFO227" offset="0x58C" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 228" name="HSMCI_FIFO228" offset="0x590" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 229" name="HSMCI_FIFO229" offset="0x594" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 230" name="HSMCI_FIFO230" offset="0x598" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 231" name="HSMCI_FIFO231" offset="0x59C" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 232" name="HSMCI_FIFO232" offset="0x5A0" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 233" name="HSMCI_FIFO233" offset="0x5A4" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 234" name="HSMCI_FIFO234" offset="0x5A8" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 235" name="HSMCI_FIFO235" offset="0x5AC" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 236" name="HSMCI_FIFO236" offset="0x5B0" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 237" name="HSMCI_FIFO237" offset="0x5B4" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 238" name="HSMCI_FIFO238" offset="0x5B8" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 239" name="HSMCI_FIFO239" offset="0x5BC" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 240" name="HSMCI_FIFO240" offset="0x5C0" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 241" name="HSMCI_FIFO241" offset="0x5C4" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 242" name="HSMCI_FIFO242" offset="0x5C8" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 243" name="HSMCI_FIFO243" offset="0x5CC" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 244" name="HSMCI_FIFO244" offset="0x5D0" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 245" name="HSMCI_FIFO245" offset="0x5D4" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 246" name="HSMCI_FIFO246" offset="0x5D8" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 247" name="HSMCI_FIFO247" offset="0x5DC" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 248" name="HSMCI_FIFO248" offset="0x5E0" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 249" name="HSMCI_FIFO249" offset="0x5E4" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 250" name="HSMCI_FIFO250" offset="0x5E8" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 251" name="HSMCI_FIFO251" offset="0x5EC" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 252" name="HSMCI_FIFO252" offset="0x5F0" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 253" name="HSMCI_FIFO253" offset="0x5F4" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
