turbq/atprog/packs/atmel/SAM3X_DFP/1.0.50/atdf/ATSAM3X8E.atdf
        <register caption="PWM Channel Dead Time Register (ch_num = 0)" name="PWM_DT0" offset="0x218" rw="RW" size="4">
          <bitfield caption="Dead-Time Value for PWMHx Output" mask="0x0000FFFF" name="DTH"/>
          <bitfield caption="Dead-Time Value for PWMLx Output" mask="0xFFFF0000" name="DTL"/>
        </register>
        <register caption="PWM Channel Dead Time Update Register (ch_num = 0)" name="PWM_DTUPD0" offset="0x21C" rw="W" size="4">
          <bitfield caption="Dead-Time Value Update for PWMHx Output" mask="0x0000FFFF" name="DTHUPD"/>
          <bitfield caption="Dead-Time Value Update for PWMLx Output" mask="0xFFFF0000" name="DTLUPD"/>
        </register>
        <register caption="PWM Channel Mode Register (ch_num = 1)" name="PWM_CMR1" offset="0x220" rw="RW" size="4">
          <bitfield caption="Channel Pre-scaler" mask="0x0000000F" name="CPRE" values="PWM_CMR1__CPRE"/>
          <bitfield caption="Channel Alignment" mask="0x00000100" name="CALG"/>
          <bitfield caption="Channel Polarity" mask="0x00000200" name="CPOL"/>
          <bitfield caption="Counter Event Selection" mask="0x00000400" name="CES"/>
          <bitfield caption="Dead-Time Generator Enable" mask="0x00010000" name="DTE"/>
          <bitfield caption="Dead-Time PWMHx Output Inverted" mask="0x00020000" name="DTHI"/>
          <bitfield caption="Dead-Time PWMLx Output Inverted" mask="0x00040000" name="DTLI"/>
        </register>
        <register caption="PWM Channel Duty Cycle Register (ch_num = 1)" name="PWM_CDTY1" offset="0x224" rw="RW" size="4">
          <bitfield caption="Channel Duty-Cycle" mask="0x00FFFFFF" name="CDTY"/>
        </register>
        <register caption="PWM Channel Duty Cycle Update Register (ch_num = 1)" name="PWM_CDTYUPD1" offset="0x228" rw="W" size="4">
          <bitfield caption="Channel Duty-Cycle Update" mask="0x00FFFFFF" name="CDTYUPD"/>
        </register>
        <register caption="PWM Channel Period Register (ch_num = 1)" name="PWM_CPRD1" offset="0x22C" rw="RW" size="4">
          <bitfield caption="Channel Period" mask="0x00FFFFFF" name="CPRD"/>
        </register>
        <register caption="PWM Channel Period Update Register (ch_num = 1)" name="PWM_CPRDUPD1" offset="0x230" rw="W" size="4">
          <bitfield caption="Channel Period Update" mask="0x00FFFFFF" name="CPRDUPD"/>
        </register>
        <register caption="PWM Channel Counter Register (ch_num = 1)" name="PWM_CCNT1" offset="0x234" rw="R" size="4">
          <bitfield caption="Channel Counter Register" mask="0x00FFFFFF" name="CNT"/>
        </register>
        <register caption="PWM Channel Dead Time Register (ch_num = 1)" name="PWM_DT1" offset="0x238" rw="RW" size="4">
          <bitfield caption="Dead-Time Value for PWMHx Output" mask="0x0000FFFF" name="DTH"/>
          <bitfield caption="Dead-Time Value for PWMLx Output" mask="0xFFFF0000" name="DTL"/>
        </register>
        <register caption="PWM Channel Dead Time Update Register (ch_num = 1)" name="PWM_DTUPD1" offset="0x23C" rw="W" size="4">
          <bitfield caption="Dead-Time Value Update for PWMHx Output" mask="0x0000FFFF" name="DTHUPD"/>
          <bitfield caption="Dead-Time Value Update for PWMLx Output" mask="0xFFFF0000" name="DTLUPD"/>
        </register>
        <register caption="PWM Channel Mode Register (ch_num = 2)" name="PWM_CMR2" offset="0x240" rw="RW" size="4">
          <bitfield caption="Channel Pre-scaler" mask="0x0000000F" name="CPRE" values="PWM_CMR2__CPRE"/>
          <bitfield caption="Channel Alignment" mask="0x00000100" name="CALG"/>
          <bitfield caption="Channel Polarity" mask="0x00000200" name="CPOL"/>
          <bitfield caption="Counter Event Selection" mask="0x00000400" name="CES"/>
          <bitfield caption="Dead-Time Generator Enable" mask="0x00010000" name="DTE"/>
          <bitfield caption="Dead-Time PWMHx Output Inverted" mask="0x00020000" name="DTHI"/>
          <bitfield caption="Dead-Time PWMLx Output Inverted" mask="0x00040000" name="DTLI"/>
        </register>
        <register caption="PWM Channel Duty Cycle Register (ch_num = 2)" name="PWM_CDTY2" offset="0x244" rw="RW" size="4">
          <bitfield caption="Channel Duty-Cycle" mask="0x00FFFFFF" name="CDTY"/>
        </register>
        <register caption="PWM Channel Duty Cycle Update Register (ch_num = 2)" name="PWM_CDTYUPD2" offset="0x248" rw="W" size="4">
          <bitfield caption="Channel Duty-Cycle Update" mask="0x00FFFFFF" name="CDTYUPD"/>
        </register>
        <register caption="PWM Channel Period Register (ch_num = 2)" name="PWM_CPRD2" offset="0x24C" rw="RW" size="4">
          <bitfield caption="Channel Period" mask="0x00FFFFFF" name="CPRD"/>
        </register>
        <register caption="PWM Channel Period Update Register (ch_num = 2)" name="PWM_CPRDUPD2" offset="0x250" rw="W" size="4">
          <bitfield caption="Channel Period Update" mask="0x00FFFFFF" name="CPRDUPD"/>
        </register>
        <register caption="PWM Channel Counter Register (ch_num = 2)" name="PWM_CCNT2" offset="0x254" rw="R" size="4">
          <bitfield caption="Channel Counter Register" mask="0x00FFFFFF" name="CNT"/>
        </register>
        <register caption="PWM Channel Dead Time Register (ch_num = 2)" name="PWM_DT2" offset="0x258" rw="RW" size="4">
          <bitfield caption="Dead-Time Value for PWMHx Output" mask="0x0000FFFF" name="DTH"/>
          <bitfield caption="Dead-Time Value for PWMLx Output" mask="0xFFFF0000" name="DTL"/>
        </register>
        <register caption="PWM Channel Dead Time Update Register (ch_num = 2)" name="PWM_DTUPD2" offset="0x25C" rw="W" size="4">
          <bitfield caption="Dead-Time Value Update for PWMHx Output" mask="0x0000FFFF" name="DTHUPD"/>
          <bitfield caption="Dead-Time Value Update for PWMLx Output" mask="0xFFFF0000" name="DTLUPD"/>
        </register>
        <register caption="PWM Channel Mode Register (ch_num = 3)" name="PWM_CMR3" offset="0x260" rw="RW" size="4">
          <bitfield caption="Channel Pre-scaler" mask="0x0000000F" name="CPRE" values="PWM_CMR3__CPRE"/>
          <bitfield caption="Channel Alignment" mask="0x00000100" name="CALG"/>
          <bitfield caption="Channel Polarity" mask="0x00000200" name="CPOL"/>
          <bitfield caption="Counter Event Selection" mask="0x00000400" name="CES"/>
          <bitfield caption="Dead-Time Generator Enable" mask="0x00010000" name="DTE"/>
          <bitfield caption="Dead-Time PWMHx Output Inverted" mask="0x00020000" name="DTHI"/>
          <bitfield caption="Dead-Time PWMLx Output Inverted" mask="0x00040000" name="DTLI"/>
        </register>
        <register caption="PWM Channel Duty Cycle Register (ch_num = 3)" name="PWM_CDTY3" offset="0x264" rw="RW" size="4">
          <bitfield caption="Channel Duty-Cycle" mask="0x00FFFFFF" name="CDTY"/>
        </register>
        <register caption="PWM Channel Duty Cycle Update Register (ch_num = 3)" name="PWM_CDTYUPD3" offset="0x268" rw="W" size="4">
          <bitfield caption="Channel Duty-Cycle Update" mask="0x00FFFFFF" name="CDTYUPD"/>
        </register>
        <register caption="PWM Channel Period Register (ch_num = 3)" name="PWM_CPRD3" offset="0x26C" rw="RW" size="4">
          <bitfield caption="Channel Period" mask="0x00FFFFFF" name="CPRD"/>
        </register>
        <register caption="PWM Channel Period Update Register (ch_num = 3)" name="PWM_CPRDUPD3" offset="0x270" rw="W" size="4">
          <bitfield caption="Channel Period Update" mask="0x00FFFFFF" name="CPRDUPD"/>
        </register>
        <register caption="PWM Channel Counter Register (ch_num = 3)" name="PWM_CCNT3" offset="0x274" rw="R" size="4">
          <bitfield caption="Channel Counter Register" mask="0x00FFFFFF" name="CNT"/>
        </register>
        <register caption="PWM Channel Dead Time Register (ch_num = 3)" name="PWM_DT3" offset="0x278" rw="RW" size="4">
          <bitfield caption="Dead-Time Value for PWMHx Output" mask="0x0000FFFF" name="DTH"/>
          <bitfield caption="Dead-Time Value for PWMLx Output" mask="0xFFFF0000" name="DTL"/>
        </register>
        <register caption="PWM Channel Dead Time Update Register (ch_num = 3)" name="PWM_DTUPD3" offset="0x27C" rw="W" size="4">
          <bitfield caption="Dead-Time Value Update for PWMHx Output" mask="0x0000FFFF" name="DTHUPD"/>
          <bitfield caption="Dead-Time Value Update for PWMLx Output" mask="0xFFFF0000" name="DTLUPD"/>
        </register>
        <register caption="PWM Channel Mode Register (ch_num = 4)" name="PWM_CMR4" offset="0x280" rw="RW" size="4">
          <bitfield caption="Channel Pre-scaler" mask="0x0000000F" name="CPRE" values="PWM_CMR4__CPRE"/>
          <bitfield caption="Channel Alignment" mask="0x00000100" name="CALG"/>
          <bitfield caption="Channel Polarity" mask="0x00000200" name="CPOL"/>
          <bitfield caption="Counter Event Selection" mask="0x00000400" name="CES"/>
          <bitfield caption="Dead-Time Generator Enable" mask="0x00010000" name="DTE"/>
          <bitfield caption="Dead-Time PWMHx Output Inverted" mask="0x00020000" name="DTHI"/>
          <bitfield caption="Dead-Time PWMLx Output Inverted" mask="0x00040000" name="DTLI"/>
        </register>
