turbq/atprog/packs/atmel/SAM3X_DFP/1.0.50/atdf/ATSAM3X8E.atdf
      <value-group caption="" name="SMC_CFG__PAGESIZE">
        <value caption="Main area 512 Bytes" name="PS512" value="0x0"/>
        <value caption="Main area 1024 Bytes" name="PS1024" value="0x1"/>
        <value caption="Main area 2048 Bytes" name="PS2048" value="0x2"/>
        <value caption="Main area 4096 Bytes" name="PS4096" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_CFG__DTOMUL">
        <value caption="DTOCYC" name="X1" value="0x0"/>
        <value caption="DTOCYC x 16" name="X16" value="0x1"/>
        <value caption="DTOCYC x 128" name="X128" value="0x2"/>
        <value caption="DTOCYC x 256" name="X256" value="0x3"/>
        <value caption="DTOCYC x 1024" name="X1024" value="0x4"/>
        <value caption="DTOCYC x 4096" name="X4096" value="0x5"/>
        <value caption="DTOCYC x 65536" name="X65536" value="0x6"/>
        <value caption="DTOCYC x 1048576" name="X1048576" value="0x7"/>
      </value-group>
      <value-group caption="" name="SMC_ECC_MD__ECC_PAGESIZE">
        <value caption="Main area 512 Words" name="PS512" value="0x0"/>
        <value caption="Main area 1024 Words" name="PS1024" value="0x1"/>
        <value caption="Main area 2048 Words" name="PS2048" value="0x2"/>
        <value caption="Main area 4096 Words" name="PS4096" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_ECC_MD__TYPCORREC">
        <value caption="1 bit correction for a page of 512/1024/2048/4096 Bytes  (for 8 or 16-bit NAND Flash)" name="CPAGE" value="0x0"/>
        <value caption="1 bit correction for 256 Bytes of data for a page of 512/2048/4096 bytes (for 8-bit NAND Flash only)" name="C256B" value="0x1"/>
        <value caption="1 bit correction for 512 Bytes of data for a page of 512/2048/4096 bytes (for 8-bit NAND Flash only)" name="C512B" value="0x2"/>
      </value-group>
      <value-group caption="" name="SMC_MODE0__READ_MODE">
        <value caption="The Read operation is controlled by the NCS signal." name="NCS_CTRL" value="0"/>
        <value caption="The Read operation is controlled by the NRD signal." name="NRD_CTRL" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE0__WRITE_MODE">
        <value caption="The Write operation is controller by the NCS signal." name="NCS_CTRL" value="0"/>
        <value caption="The Write operation is controlled by the NWE signal." name="NWE_CTRL" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE0__EXNW_MODE">
        <value caption="Disabled" name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode" name="FROZEN" value="0x2"/>
        <value caption="Ready Mode" name="READY" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_MODE0__DBW">
        <value caption="8-bit bus" name="BIT_8" value="0"/>
        <value caption="16-bit bus" name="BIT_16" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE1__READ_MODE">
        <value caption="The Read operation is controlled by the NCS signal." name="NCS_CTRL" value="0"/>
        <value caption="The Read operation is controlled by the NRD signal." name="NRD_CTRL" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE1__WRITE_MODE">
        <value caption="The Write operation is controller by the NCS signal." name="NCS_CTRL" value="0"/>
        <value caption="The Write operation is controlled by the NWE signal." name="NWE_CTRL" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE1__EXNW_MODE">
        <value caption="Disabled" name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode" name="FROZEN" value="0x2"/>
        <value caption="Ready Mode" name="READY" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_MODE1__DBW">
        <value caption="8-bit bus" name="BIT_8" value="0"/>
        <value caption="16-bit bus" name="BIT_16" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE2__READ_MODE">
        <value caption="The Read operation is controlled by the NCS signal." name="NCS_CTRL" value="0"/>
        <value caption="The Read operation is controlled by the NRD signal." name="NRD_CTRL" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE2__WRITE_MODE">
        <value caption="The Write operation is controller by the NCS signal." name="NCS_CTRL" value="0"/>
        <value caption="The Write operation is controlled by the NWE signal." name="NWE_CTRL" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE2__EXNW_MODE">
        <value caption="Disabled" name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode" name="FROZEN" value="0x2"/>
        <value caption="Ready Mode" name="READY" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_MODE2__DBW">
        <value caption="8-bit bus" name="BIT_8" value="0"/>
        <value caption="16-bit bus" name="BIT_16" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE3__READ_MODE">
        <value caption="The Read operation is controlled by the NCS signal." name="NCS_CTRL" value="0"/>
        <value caption="The Read operation is controlled by the NRD signal." name="NRD_CTRL" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE3__WRITE_MODE">
        <value caption="The Write operation is controller by the NCS signal." name="NCS_CTRL" value="0"/>
        <value caption="The Write operation is controlled by the NWE signal." name="NWE_CTRL" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE3__EXNW_MODE">
        <value caption="Disabled" name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode" name="FROZEN" value="0x2"/>
        <value caption="Ready Mode" name="READY" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_MODE3__DBW">
        <value caption="8-bit bus" name="BIT_8" value="0"/>
        <value caption="16-bit bus" name="BIT_16" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE4__READ_MODE">
        <value caption="The Read operation is controlled by the NCS signal." name="NCS_CTRL" value="0"/>
        <value caption="The Read operation is controlled by the NRD signal." name="NRD_CTRL" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE4__WRITE_MODE">
        <value caption="The Write operation is controller by the NCS signal." name="NCS_CTRL" value="0"/>
        <value caption="The Write operation is controlled by the NWE signal." name="NWE_CTRL" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE4__EXNW_MODE">
        <value caption="Disabled" name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode" name="FROZEN" value="0x2"/>
        <value caption="Ready Mode" name="READY" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_MODE4__DBW">
        <value caption="8-bit bus" name="BIT_8" value="0"/>
        <value caption="16-bit bus" name="BIT_16" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE5__READ_MODE">
        <value caption="The Read operation is controlled by the NCS signal." name="NCS_CTRL" value="0"/>
        <value caption="The Read operation is controlled by the NRD signal." name="NRD_CTRL" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE5__WRITE_MODE">
        <value caption="The Write operation is controller by the NCS signal." name="NCS_CTRL" value="0"/>
        <value caption="The Write operation is controlled by the NWE signal." name="NWE_CTRL" value="1"/>
      </value-group>
