turbq/atprog/packs/atmel/SAM3X_DFP/1.0.50/atdf/ATSAM3X8E.atdf
        <register caption="Device Endpoint Disable Register (n = 0) 5" name="UOTGHS_DEVEPTIDR5" offset="0x234" rw="W" size="4">
          <bitfield caption="Transmitted IN Interrupt Clear" mask="0x00000001" name="TXINEC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTEC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPEC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTEC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINEC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFEC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDEC"/>
          <bitfield caption="Shortpacket Interrupt Clear" mask="0x00000080" name="SHORTPACKETEC"/>
          <bitfield caption="Number of Busy Banks Interrupt Clear" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Clear" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Clear" mask="0x00010000" name="EPDISHDMAC"/>
          <bitfield caption="NYET Token Disable Clear" mask="0x00020000" name="NYETDISC"/>
          <bitfield caption="STALL Request Clear" mask="0x00080000" name="STALLRQC"/>
        </register>
        <register caption="Device Endpoint Disable Register (n = 0) 6" name="UOTGHS_DEVEPTIDR6" offset="0x238" rw="W" size="4">
          <bitfield caption="Transmitted IN Interrupt Clear" mask="0x00000001" name="TXINEC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTEC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPEC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTEC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINEC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFEC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDEC"/>
          <bitfield caption="Shortpacket Interrupt Clear" mask="0x00000080" name="SHORTPACKETEC"/>
          <bitfield caption="Number of Busy Banks Interrupt Clear" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Clear" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Clear" mask="0x00010000" name="EPDISHDMAC"/>
          <bitfield caption="NYET Token Disable Clear" mask="0x00020000" name="NYETDISC"/>
          <bitfield caption="STALL Request Clear" mask="0x00080000" name="STALLRQC"/>
        </register>
        <register caption="Device Endpoint Disable Register (n = 0) 7" name="UOTGHS_DEVEPTIDR7" offset="0x23C" rw="W" size="4">
          <bitfield caption="Transmitted IN Interrupt Clear" mask="0x00000001" name="TXINEC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTEC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPEC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTEC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINEC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFEC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDEC"/>
          <bitfield caption="Shortpacket Interrupt Clear" mask="0x00000080" name="SHORTPACKETEC"/>
          <bitfield caption="Number of Busy Banks Interrupt Clear" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Clear" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Clear" mask="0x00010000" name="EPDISHDMAC"/>
          <bitfield caption="NYET Token Disable Clear" mask="0x00020000" name="NYETDISC"/>
          <bitfield caption="STALL Request Clear" mask="0x00080000" name="STALLRQC"/>
        </register>
        <register caption="Device Endpoint Disable Register (n = 0) 8" name="UOTGHS_DEVEPTIDR8" offset="0x240" rw="W" size="4">
          <bitfield caption="Transmitted IN Interrupt Clear" mask="0x00000001" name="TXINEC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTEC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPEC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTEC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINEC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFEC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDEC"/>
          <bitfield caption="Shortpacket Interrupt Clear" mask="0x00000080" name="SHORTPACKETEC"/>
          <bitfield caption="Number of Busy Banks Interrupt Clear" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Clear" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Clear" mask="0x00010000" name="EPDISHDMAC"/>
          <bitfield caption="NYET Token Disable Clear" mask="0x00020000" name="NYETDISC"/>
          <bitfield caption="STALL Request Clear" mask="0x00080000" name="STALLRQC"/>
        </register>
        <register caption="Device Endpoint Disable Register (n = 0) 9" name="UOTGHS_DEVEPTIDR9" offset="0x244" rw="W" size="4">
          <bitfield caption="Transmitted IN Interrupt Clear" mask="0x00000001" name="TXINEC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTEC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPEC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTEC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINEC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFEC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDEC"/>
          <bitfield caption="Shortpacket Interrupt Clear" mask="0x00000080" name="SHORTPACKETEC"/>
          <bitfield caption="Number of Busy Banks Interrupt Clear" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Clear" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Clear" mask="0x00010000" name="EPDISHDMAC"/>
          <bitfield caption="NYET Token Disable Clear" mask="0x00020000" name="NYETDISC"/>
          <bitfield caption="STALL Request Clear" mask="0x00080000" name="STALLRQC"/>
        </register>
        <register caption="Device DMA Channel Next Descriptor Address Register (n = 1)" name="UOTGHS_DEVDMANXTDSC1" offset="0x310" rw="RW" size="4">
          <bitfield caption="Next Descriptor Address" mask="0xFFFFFFFF" name="NXT_DSC_ADD"/>
        </register>
